animals = ['медведь', 'питон', 'пингвин', 'кенгуру', 'кит', 'утконос']
print(f"Животное с индексом 1 - {animals[1]} - является вторым в списке")
print(f"Животное с индексом 2 - {animals[2]} - является третьим в списке")
print(f"Животное с индексом 3 - {animals[3]} - является четвертым в списке")
print(f"Животное с индексом 4 - {animals[4]} - является пятым в списке")
print(f"Животное с индексом 5 - {animals[5]} - является шестым в списке")
print(f"Животное с индексом 0 - {animals[0]} - является первым в списке")


print(f"Первое животное в списке - {animals[0]} - имеет индекс 0")
print(f"Второе животное в списке - {animals[1]} - имеет индекс 1")
print(f"Третье животное в списке - {animals[2]} - имеет индекс 2")
print(f"Четвертое животное в списке - {animals[3]} - имеет индекс 3")
print(f"Пятое животное в списке - {animals[4]} - имеет индекс 4")
print(f"Шестое животное в списке - {animals[5]} - имеет индекс 5")
