# Используется для проверки истинности указанного утверждения. Инструкция assert позволяет производить проверки
# истинности утверждений, что может быть использовано в отладочных целях. Если проверка не прошла, возбуждается
# исключение AssertionError.
#
# Рекомендуется использовать инструкцию только для проверки внутреннего состояния программы — ситуаций, которые не
# должны происходить вовсе, которые нельзя обработать или это не имеет смысла (обычно это является указанием на то,
# что код программы содержит ошибку). Инструкция также может использоваться для документирования ожиданий (например,
# входных параметров или результата). В остальных случаях следует определять свои типы исключений.
