# Конструкция with ... as используется для оборачивания выполнения блока инструкций менеджером контекста.
# Для чего применяется конструкция with ... as? Для гарантии того, что критические функции выполнятся в любом случае.
# Самый распространённый пример использования этой конструкции - открытие файлов.
# конструкция with ... as, как правило, является более удобной и гарантирует закрытие файла в любом случае.

with open('test.txt', 'wt', encoding='UTF-8') as InFile:
    num = int(input("Введите число: "))
    line = str('1 / ' + str(num) + ' = ' + str(1 / num))
    print(line)
    InFile.write(line)
