from sys import exit
from random import randint
from textwrap import dedent


class Scene(object):
    def enter(self):
        print("Эта сцена еще не настроена."
              "Создайте подкласс и реализуйте функцию enter()")
        exit(1)


class Engine(object):
    """Движок"""

    def __init__(self, scene_map):
        self.scene_map = scene_map

    def play(self):
        current_scene = self.scene_map.opening_scene()
        last_scene = self.scene_map.next_scene('finished')

        while current_scene != last_scene:
            next_scene_name = current_scene.enter()
            current_scene = self.scene_map.next_scene(next_scene_name)

        current_scene.enter()


class Death(Scene):
    """Смерть"""
    quips = [
        "Ты погиб. Как это ни печально.",
        "Надо было быть умнее.",
        "Надо же было быть таким придурком.",
        "Даже мой щенок соображает лучше.",
        "Когда ж ты уже повзрослеешь, как говорил твой папка."
    ]

    def enter(self):
        print(Death.quips[randint(0, len(self.quips) - 1)])
        exit(1)


class CentralCorridor(Scene):
    """Центральный корридор"""

    def enter(self):
        print(dedent("""
        Готоны с планеты Перкаль 25 захватили ваш корабль и уничтожиливсю команду.
        Ты - единственный, кто остался в живых. Тебе нужно выкрасть нейтронную бомбу в оружейной лаборатории, заложить 
        ее в топливном отсеке и покинуть корабль в спасательной капсуле, прежде чем он взорвется.
        
        Ты бежишь по центральному коридору в оружейную лабораторию, когда перед тобой появляется готон с красной 
        чешуйчатой кожей, гнилыми зубами и в костюме клоуна. 
        Он с ненавистью смотрит на тебя и, перегородив дорогу в лабораторию, вытаскивает бластер, чтобы отправить тебя к праотцам.
        1 - стрелять
        2 - проскочить
        3 - пошутить
        """))
        action = input("> ")
        if action == "1":
            print(dedent("""
            Ты быстро выхватываешь бластер и начинаешь палить по готону. Его клоунский наряд крутиться на теле, мешая лучам попадать в цель.
            Все твои выстрелы потерпели неудачу, и заряд бластера иссяк. 
            Костюм готона, который купила его мать, безнадежно испорчен, поэтому инопланетянин в ярости выхватывает бластер и 
            стреляет тебе в голову. В панике ты патыешься удрать и, резко повернувшись, ударяешься головой о балку и теряешь сознание.
            Ты пал смертью храбрых.
            """))
            return 'death'
        elif action == "2":
            print(dedent("""
            Словно боксер мирового класса, ты уворачиваешься и проскакиваешь мимо готона, краем глаза замечая, что его бластер направлен тебе в голову.
            И тут ты подскальзываешься и врезаешься в стену. От удара ты теряешь сознание.
            Придя в сознание, ты успеваешь почувствовать, что готон топчется на твоей голове и пожирает тебя.
            Свет меркнет перед глазами.
            """))
            return 'death'
        elif action == "3":
            print(dedent("""
            К счастью, ты знаком с культурой готонов и знаешь, что их может рассмешить.
            Ты рассказываешь бородатый анекдот: 
            Неоколонии, изоморфно релятивные к мультиполосным гиперболическим параболоидам, теоретически катаральны.
            Готон замирает, старается сдержать смех, а затем начинает безудержно хохотать.
            Пока он смеется, ты достаешь бластер и стреляешь готону в голову. Он падает, а ты перепрыгиваешь через него
            и бежишь в оружейную лабораторию.
            """))
            return 'laser_weapon_armory'
        else:
            print("Так нельзя поступить!")
            return 'central_corridor'


class LaserWeaponArmory(Scene):
    """Оружейная лаборатория"""

    def enter(self):
        print(dedent("""
        Ты вбегаешь в оружейную лабораторию и начинаешь обыскивать комнату, спрятались ли тут другие готоны.
        Стоит мертвая тишина. Ты бежишь в дальний угол комнаты и находишь нейтронную бомбу в защитном контейнере.
        На лицевой стороне контейнера расположена панель с кнопками.
        Тебе надо ввести правильный код, чтобы достать бомбу.
        Если ты 10 раз введешь неправильный код, то контейнер заблокируется и ты не сможешь достать бомбу.
        Учти, что код состоит из трех цифр.
        """))
        code = f"{randint(1, 9)}{randint(1, 9)}{randint(1, 9)}"
        guesses = 0
        guess = input("key > ")
        while (guess != code or guess != "121") and guesses < 10:
            print("ВЖЖЖЖИК!")
            guesses += 1
            guess = input("key > ")
            if guess == code or guess == "121":
                print(dedent("""
                Контейнер открывается с щелчком и выпускает сизый газ. Ты вытаскиваешь нейтронную бомбу и бежишь
                в топливный отсек, чтобы установить бомбу в нужном месте, активировать ее и успеть смотаться с корабля.
                """))
                return 'the_bridge'
            elif (guess != code or guess != "121") and guesses == 9:
                print(dedent("""
                Ты слышишь как замок жужжит в последний раз, а затем чувствуешь запах гари - замок расплавился. 
                Ты остаешься в оружейной лавке, пока наконец готоны не взрывают корабль выстрелом со своего судна.
                Ты умираешь.
                """))
                return 'death'


class TheBridge(Scene):
    """Топливный отсек"""

    def enter(self):
        print(dedent("""
        Ты вбегаешь в топливный отсек с нейтронной бомбой и видишь пятерых готонов, безуспешно пытающихся управлять кораблем.
        Один уродливее другого, и все в клоунских костюмах, как и готон, убитый тобой.
        Они не достают оружие, так как видят бомбу в твоих руках и не хотят, чтобы ты взорвал ее.
        Преимущество явно на твоей стороне.
        1 - бросить бомбу
        2 - установить бомбу
        """))
        action = input(" > ")
        if action == "1":
            print(dedent("""
            Ты в панике активируешь бомбу и бросаешь ее в толпу готонов, а затем прыгаешь к двери шлюза.
            Сразу после этого один из готонов стреляет тебе в спину.
            Умирая, ты видишь, кк другие готоны тщетно пытаются деактивировать бомбу. Ты осознаешь, что готоны тоже погибнут.
            Свет меркнет перед глазами.
            """))
            return 'death'
        elif action == "2":
            print(dedent("""
            Ты указываешь бластером на бомбу в своих руках.
            Готоны поднимают лапы вверх и в страхе потеют. Ты осторожно, не отворачиваясь подходишь к двери и
            аккуратно устанавливаешь бомбу, держа готонов на мушке. 
            Ты запрыгиваешь в шлюз и закрываешь дверь ударом по кнопке, а затем бластером расплавляешь замок, чтобы готоны
            не смогли открыть ее. 
            Теперь тебе нужно залезть в спасательную капсулу и удрать с корабля к чертям собачьим.
            """))
            return 'escape_pod'
        else:
            print("Так нельзя поступить!")
            return 'the_bridge'


class EscapePod(Scene):
    """Спасательная капсула"""

    def enter(self):
        print(dedent("""
        Ты мчишься по отсеку со спасательными капсулами. Некоторые из них могут быть повреждены и взорвуться во время полета.
        Всего капсул пять, и у тебя нет времени, чтобы осматривать каждую из них на отсутствие повреждений.
        Задумавшись на секунду, ты решаешь сесть в капсулу под номером ...
        Какую ты выберешь капслулу?
        """))
        good_pod = randint(1, 5)
        guess = int(input(" Капсула № >  "))
        if guess != good_pod:
            print(dedent(f"""
            Ты запрыгиваешь в капслулу №{guess} и нажимаешь кнопку отстыковки. 
            Капсула вылетает в космическое пространство, а затем взрывается с яркой вспышкой, разбрасывая осколки.
            Ты умираешь.
            """))
            return 'death'
        else:
            print(dedent(f"""
            Ты запрыгиваешь в капсулу №{guess} и нажимаешь кнопку отстыковки.
            Капсула вылетает в космическое пространство, а затем отправляется к планете неподалеку. 
            Ты смотришь в иллюминатор и видишь как твой корабль взрывается.
            Его осколки повреждают топливный отсек корабля готонов и тот тоже разлетается в клочья.
            Победа за вами!
            """))
            return 'finished'


class Finished(Scene):
    def enter(self):
        print("Ты победил! Отличная работа")
        return 'finished'


class Map(object):
    """Карта"""
    scenes = {
        'central_corridor': CentralCorridor(),
        'laser_weapon_armory': LaserWeaponArmory(),
        'the_bridge': TheBridge(),
        'escape_pod': EscapePod(),
        'death': Death(),
        'finished': Finished(),
    }

    def __init__(self, start_scene):
        self.start_scene = start_scene

    def next_scene(self, scene_name):
        val = Map.scenes.get(scene_name)
        return val

    def opening_scene(self):
        return self.next_scene(self.start_scene)


a_map = Map('central_corridor')
a_game = Engine(a_map)
a_game.play()
